# frozen_string_literal: true

# vim: ft=ruby
# © 2026 Konstantin Gredeskoul

# This file will install brew packages defined here when run via the `brew bundle` command.
# @see https://docs.brew.sh/Brew-Bundle-and-Brewfile

brew "bash"
brew "bat"
brew "codespell"
brew "coreutils"
brew "curl"
brew "direnv"
brew "fd"
brew "gawk"
brew "gsed"
brew "jq"
brew "just"
brew "lefthook"
brew "mdformat"
brew "memcached"
brew "postgresql@18"
brew "redis"
brew "ripgrep"
brew "uv"
brew "volta"
brew "yq"
